Revit 2027 API
BuiltInFailures.CurtainWallFailures.CannotHaveIndependentOverlappingGrids Property
 Overlapping independent type associated gridlines are not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotHaveIndependentOverlappingGrids { get; }
Public Shared ReadOnly Property CannotHaveIndependentOverlappingGrids As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotHaveIndependentOverlappingGrids {
	FailureDefinitionId^ get ();
}
static member CannotHaveIndependentOverlappingGrids : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace